Revit 2027 API
UV.Subtract Method
Subtracts the specified 2-D vector from this 2-D vector and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV Subtract(
	UV source
)
Public Function Subtract (
	source As UV
) As UV
public:
UV^ Subtract(
	UV^ source
)
member Subtract :
        source : UV -> UV
Parameters
source UV
The vector to subtract from this vector.
Return Value
UV
The 2-D vector equal to the difference between the two vectors.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when left is null.
Remarks
 The subtracted vector is obtained by subtracting each coordinate of the specified vector from the corresponding coordinate of this vector.
See Also
Reference
UV Class
Autodesk.Revit.DB Namespace